results/artifacts/isim-architecture-full.mmd
graph LR
  n0["bufio"]
  n1["bytes"]
  n2["cap:net"]
  n3["cap:reflect"]
  n4["cap:syscall"]
  n5["heap"]
  n6["context"]
  n7["sha256"]
  n8["binary"]
  n9["csv"]
  n10["hex"]
  n11["json"]
  n12["env:HF_TOKEN"]
  n13["errors"]
  n14["flag"]
  n15["flag:update-golden"]
  n16["fmt"]
  n17["uuid"]
  n18["inference-sim"]
  n19["cmd"]
  n20["sim"]
  n21["cluster"]
  n22["hash"]
  n23["testutil"]
  n24["tokenid"]
  n25["util"]
  n26["kv"]
  n27["latency"]
  n28["lora"]
  n29["saturation"]
  n30["trace"]
  n31["workload"]
  n32["logrus"]
  n33["cobra"]
  n34["distuv"]
  n35["yaml.v3"]
  n36["fnv"]
  n37["io"]
  n38["math"]
  n39["rand"]
  n40["http"]
  n41["os"]
  n42["signal"]
  n43["filepath"]
  n44["reflect"]
  n45["regexp"]
  n46["runtime"]
  n47["slices"]
  n48["sort"]
  n49["strconv"]
  n50["strings"]
  n51["sync"]
  n52["atomic"]
  n53["syscall"]
  n54["testing"]
  n55["time"]
  n18 --> n19
  n19 -.-> n0
  n19 -.-> n1
  n19 -.-> n6
  n19 -.-> n8
  n19 -.-> n11
  n19 -. config .-> n12
  n19 -.-> n13
  n19 -.-> n16
  n19 -.-> n17
  n19 --> n20
  n19 --> n21
  n19 --> n27
  n19 -.-> n28
  n19 --> n29
  n19 --> n30
  n19 --> n31
  n19 -.-> n32
  n19 -.-> n33
  n19 -.-> n35
  n19 -.-> n36
  n19 -.-> n37
  n19 -.-> n38
  n19 -.-> n39
  n19 -.-> n40
  n19 -.-> n41
  n19 -.-> n42
  n19 -.-> n43
  n19 -.-> n45
  n19 -.-> n48
  n19 -.-> n49
  n19 -.-> n50
  n19 -.-> n51
  n19 -.-> n52
  n19 -.-> n53
  n19 -.-> n55
  n20 -.-> n1
  n20 -.-> n5
  n20 -.-> n11
  n20 -.-> n16
  n20 --> n22
  n20 -.-> n24
  n20 --> n25
  n20 -.-> n32
  n20 -.-> n35
  n20 -.-> n36
  n20 -.-> n38
  n20 -.-> n39
  n20 -.-> n41
  n20 -.-> n47
  n20 -.-> n48
  n20 -.-> n49
  n20 -.-> n50
  n21 -.-> n5
  n21 -.-> n13
  n21 -.-> n16
  n21 --> n20
  n21 -. implements .-> n20
  n21 --> n26
  n21 --> n27
  n21 --> n30
  n21 -.-> n31
  n21 -.-> n32
  n21 -.-> n38
  n21 -.-> n39
  n21 -.-> n44
  n21 -.-> n48
  n21 -.-> n49
  n21 -.-> n50
  n21 -.-> n55
  n22 -.-> n7
  n22 -.-> n10
  n22 -.-> n16
  n22 -.-> n24
  n22 -.-> n49
  n23 -.-> n11
  n23 -.-> n14
  n23 -. config .-> n15
  n23 -.-> n38
  n23 -.-> n41
  n23 -.-> n43
  n23 -.-> n46
  n23 -.-> n54
  n26 -.-> n16
  n26 --> n20
  n26 -. implements .-> n20
  n26 --> n22
  n26 --> n25
  n26 -.-> n32
  n26 -.-> n38
  n27 -.-> n11
  n27 -.-> n16
  n27 --> n20
  n27 -. implements .-> n20
  n27 -.-> n32
  n27 -.-> n38
  n27 -.-> n41
  n27 -.-> n45
  n27 -.-> n48
  n27 -.-> n49
  n27 -.-> n50
  n28 -.-> n16
  n28 -. implements .-> n20
  n28 -.-> n20
  n28 -.-> n38
  n28 -.-> n48
  n29 -.-> n16
  n29 -. implements .-> n20
  n29 -.-> n20
  n29 --> n31
  n29 -.-> n38
  n29 -.-> n48
  n31 -.-> n1
  n31 -.-> n5
  n31 -.-> n9
  n31 -.-> n11
  n31 -.-> n16
  n31 --> n20
  n31 -.-> n32
  n31 -.-> n34
  n31 -.-> n35
  n31 -.-> n37
  n31 -.-> n38
  n31 -.-> n39
  n31 -.-> n41
  n31 -.-> n43
  n31 -.-> n48
  n31 -.-> n49
  n31 -.-> n50
  n31 -.-> n55
